Revit 2027 API
ExternalService.GetServer Method
 Returns the instance that provides implementation for a registered server.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IExternalServer GetServer(
	Guid serverId
)
Public Function GetServer (
	serverId As Guid
) As IExternalServer
public:
IExternalServer^ GetServer(
	Guid serverId
)
member GetServer :
        serverId : Guid -> IExternalServer
Parameters
serverId Guid
 Id of a registered server
Return Value
IExternalServer
 An instance of the server interface. NULL is returned if the server is invalid (e.g. destroyed)
Exceptions
Exception | Condition
ArgumentException |  The given Id is not a valid GUID value.
See Also
Reference
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace